       IDENTIFICATION DIVISION.
       PROGRAM-ID.    CREADOR.
      ******************************
      * SISTEMA DE VENCIMIENTOS    *
      * AUTOR: JOSE LUIS PLANES    *
      ******************************
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CONTRI ASSIGN TO DISK
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  RECORD KEY IS NUM-CO
                  ALTERNATE RECORD IS NOMBRE
                  WITH DUPLICATES.

           SELECT CODI ASSIGN TO DISK
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  RECORD KEY IS N-CODI.

           SELECT IMPU ASSIGN TO DISK
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  RECORD KEY IS NUM-CO1
                  ALTERNATE RECORD IS TIP-IMP
                  WITH DUPLICATES
                  ALTERNATE RECORD IS FEC-VEN
                  WITH DUPLICATES
                  ALTERNATE RECORD IS FEC-PAG
                  WITH DUPLICATES
                  ALTERNATE RECORD IS ANO
                  WITH DUPLICATES.

           SELECT RPAGOS ASSIGN TO DISK.

           SELECT RDATOS ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.

       FD  CONTRI LABEL RECORD IS STANDARD
           VALUE OF FILE-ID "ARCONT"
           DATA RECORD IS REG-CON.

       01  REG-CON.
           03 NUM-CO          PIC X(25).
           03 NOMBRE          PIC X(25).
           03 DOMICILIO       PIC X(25).

       FD  CODI LABEL RECORD IS STANDARD
           VALUE OF FILE-ID "ARCODI"
           DATA RECORD IS REG-CODI.

       01  REG-CODI.
           03 N-CODI          PIC 99.
           03 B-CODI          PIC X(15).

       FD  IMPU LABEL RECORD IS STANDARD
           VALUE OF FILE-ID "ARIMPU"
           DATA RECORD IS REG-IMP.

       01  REG-IMP.
           03 NUM-CO1.
              05 CONT            PIC X(25).
              05 PERI.
                 07 AA           PIC 99.
                 07 P1           PIC 99.
           03 TIP-IMP            PIC 99.
           03 FEC-VEN.
              05 DDV             PIC 99.
              05 MMV             PIC 99.
              05 AAV             PIC 99.
           03 FEC-PAG.
              05 DDP             PIC 99.
              05 MMP             PIC 99.
              05 AAP             PIC 99.
           03 MONTO              PIC 9(11)V99.
           03 ANO                PIC 99.

       FD  RPAGOS LABEL RECORD IS STANDARD
           VALUE OF FILE-ID "ARPAGOS"
           DATA RECORD IS REG-PAG.

       01  REG-PAG.
           03 REG-CIM            PIC X(25).
           03 REG-MPO            PIC 9(11)V99.
           03 REG-FEC.
              05 RFD             PIC 99.
              05 RFM             PIC 99.
              05 RFA             PIC 99.
           03 REG-GM             PIC 99.

       FD  RDATOS LABEL RECORD IS STANDARD
           VALUE OF FILE-ID "ARDATOS"
           DATA RECORD IS REG-DATOS.

       01  REG-DATOS.
           03 REG-NOMEMP          PIC X(40).
           03 REG-CIUD            PIC X(40).


       WORKING-STORAGE SECTION.

       01  LINEAS.
           03 L-1              PIC X(78) VALUE ALL "Í".
           03 L-2              PIC X VALUE "º".
           03 L-NOMEMP         PIC X(40).
           03 L-CIUD           PIC X(40).

       SCREEN SECTION.

       01 L-PANTALLA.
          03 BLANK SCREEN.

       01 RECUADRO-TITULOS.
           03 LINE 1 COLUMN 1 FOREGROUND-COLOR 2  VALUE "É".
           03 LINE 1 COLUMN 2 FOREGROUND-COLOR 2  PIC X(78) USING L-1.
           03 LINE 1 COLUMN 80 FOREGROUND-COLOR 2  VALUE "»".
           03 LINE 2 COLUMN 1 FOREGROUND-COLOR 2 PIC X USING L-2.
           03 LINE 2 COLUMN 80 FOREGROUND-COLOR 2 PIC X USING L-2.
           03 LINE 3 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 3 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 4 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 4 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 5 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 5 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 6 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 6 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 7 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 7 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 8 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 8 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 9 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 9 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 10 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 10 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 11 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 11 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 12 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 12 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 13 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 13 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 14 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 14 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 15 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 15 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 16 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 16 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 17 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 17 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 18 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 18 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 19 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 19 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 20 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 20 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 21 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 21 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 22 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 22 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 23 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 23 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 24 COLUMN 1 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 24 COLUMN 80 FOREGROUND-COLOR 2  PIC X USING L-2.
           03 LINE 25 COLUMN 1 FOREGROUND-COLOR 2  VALUE "È".
           03 LINE 25 COLUMN 2 FOREGROUND-COLOR 2  PIC X(78) USING L-1.
           03 LINE 25 COLUMN 80 FOREGROUND-COLOR 2  VALUE "¼".

       01 PEDIR-DATOS.
           03 LINE 5 COLUMN 30 FOREGROUND-COLOR 6  VALUE
             "SISTEMA DE IMPUESTOS".
           03 LINE 6 COLUMN 30 FOREGROUND-COLOR 6  VALUE
             "--------------------".
           03 LINE 12 COLUMN 15 FOREGROUND-COLOR 3 VALUE
             "NOMBRE DE LA EMPRESA:".
           03 LINE 12 COLUMN 37 BACKGROUND-COLOR 4
             PIC X(40) USING L-NOMEMP.
           03 LINE 14 COLUMN 15 FOREGROUND-COLOR 3 VALUE
             "CIUDAD..............:".
           03 LINE 14 COLUMN 37 BACKGROUND-COLOR 4
             PIC X(40) USING L-CIUD.

       PROCEDURE DIVISION.
       GRABAR.
           OPEN OUTPUT CONTRI.
           OPEN OUTPUT IMPU.
           OPEN OUTPUT RPAGOS.
           OPEN OUTPUT CODI.
           OPEN OUTPUT RDATOS.
           DISPLAY L-PANTALLA.
           DISPLAY RECUADRO-TITULOS.
           DISPLAY PEDIR-DATOS.
           ACCEPT (12, 37) L-NOMEMP WITH PROMPT.
           ACCEPT (14, 37) L-CIUD WITH PROMPT.
           MOVE L-NOMEMP TO REG-NOMEMP.
           MOVE L-CIUD TO REG-CIUD.
           MOVE "A" TO NOMBRE.
           WRITE REG-DATOS.
           WRITE REG-CON.
           WRITE REG-IMP.
           WRITE REG-PAG.
           MOVE ZEROS TO N-CODI.
           WRITE REG-CODI.
           CLOSE CONTRI IMPU.
           CLOSE RPAGOS CODI RDATOS.
           STOP RUN.
